src/cf/InformationRegisters/ДокументыАУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДокументыАУСН</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовАУСН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрочитатьПовторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДокументовАУСН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СтатусыДокументовАУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыДокументовАУСН</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтправленоВФНС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленоВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставленоВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбрабатываетсяБанком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработаноБанком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОбработкиБанком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленоПользователю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставленоПользователю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбрабатываетсяПользователем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработаноПользователем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОбработкиПользователем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетОтправкиВБанк</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/ДокументыАУСН/Forms/ЖурналОбмена/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВариантОтбора") Тогда
		ВариантОтбораДокументов = Параметры.ВариантОтбора;
	Иначе
		ВариантОтбораДокументов = "Все";
	КонецЕсли;
	Если Параметры.Свойство("Организация") И ЗначениеЗаполнено(Параметры.Организация) Тогда
		ОтборОрганизация = Параметры.Организация;
		ОтборОрганизацияИспользование = Истина;
		ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
	КонецЕсли;
	Если Параметры.Свойство("Банк") И ЗначениеЗаполнено(Параметры.Банк) Тогда
		ОтборБанк = Параметры.Банк;
		ОтборБанкИспользование = Истина;
		ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Банк");
	КонецЕсли;
	УстановитьВариантОтбораДокументов(ЭтотОбъект);
	ПодключенныеБанки = ИнтеграцияАУСН.ПодключенныеБанки();
	АдресХранилищаПодключенныеБанки = ПоместитьВоВременноеХранилище(
		ПодключенныеБанки.ВыгрузитьКолонку("Банк"), УникальныйИдентификатор);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = ИнтеграцияАУСНКлиент.ИмяСобытияОбменССервисом() Тогда
		УправлениеФормой(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантОтбораДокументовПриИзменении(Элемент)
	
	УстановитьВариантОтбораДокументов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияИспользованиеПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	Элементы.СписокПрочитатьПовторно.Доступность = ТекущаяСтрока <> Неопределено
		И ТекущаяСтрока.Статус = ПредопределенноеЗначение("Перечисление.СтатусыДокументовАУСН.ОшибкаОбработкиПользователем");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборБанкИспользованиеПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Банк"); 
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборБанкПриИзменении(Элемент)
	
	ОтборБанкИспользование = ЗначениеЗаполнено(ОтборБанк);
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Банк");
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрочитатьПовторно(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	ДокументыАУСНДляИзменения = Новый Массив;
	Для Каждого Строка Из ВыделенныеСтроки Цикл 
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(Строка);
		Если ДанныеСтроки.Статус = ПредопределенноеЗначение(
			"Перечисление.СтатусыДокументовАУСН.ОшибкаОбработкиПользователем") Тогда
			ДокументыАУСНДляИзменения.Добавить(ДанныеСтроки.Идентификатор);
		КонецЕсли;
	КонецЦикла;
	ПодготовитьДокументыКПовторномуЧтениюНаСервере(ДокументыАУСНДляИзменения);
	ИнтеграцияАУСНКлиент.ВыполнитьОбменССервисом(ЭтотОбъект, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВариантОтбораДокументов(Форма)
	
	Настройки = Форма.Список.КомпоновщикНастроек.Настройки;
	
	ИмяПоля = "Статус";
	
	Если Форма.ВариантОтбораДокументов = ВариантОтбораДокументыСОшибками() Тогда
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(
			Настройки.Отбор,
			ИмяПоля);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Настройки.Отбор,
			ИмяПоля,
			ПредопределенноеЗначение("Перечисление.СтатусыДокументовАУСН.ОшибкаОбработкиПользователем"),
			ВидСравненияКомпоновкиДанных.Равно,
			,
			Истина);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(
			Настройки.Отбор,
			ИмяПоля);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВариантОтбораДокументыСОшибками()
	
	Возврат "СОшибками";
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Если Форма.ОтборОрганизацияИспользование Тогда
		Организация = Форма.ОтборОрганизация;
	Иначе
		Организация = Неопределено;
	КонецЕсли;
	Если Форма.ОтборБанкИспользование Тогда
		Банк = Форма.ОтборБанк;
	Иначе
		Банк = Неопределено;
	КонецЕсли;
	Элементы.ГруппаВариантОтбораДокументов.Видимость = ЕстьДокументыСОшибками(Организация, Банк);
	Если Не Элементы.ГруппаВариантОтбораДокументов.Видимость Тогда
		Форма.ВариантОтбораДокументов = "Все";
		УстановитьВариантОтбораДокументов(Форма);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьДокументыСОшибками(Организация, Банк)
	
	Возврат РегистрыСведений.ДокументыАУСН.ЕстьДокументыСОшибками(Организация, Банк);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПодготовитьДокументыКПовторномуЧтениюНаСервере(ДокументыКПовторномуЧтению)
	
	РегистрыСведений.ДокументыАУСН.ПодготовитьКПовторномуЧтению(ДокументыКПовторномуЧтению);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборБанкНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрываемойФормы = Новый Структура;
	ОтборОкрываемойФормы = Новый Структура;
	ПодключенныеБанки = ПолучитьИзВременногоХранилища(АдресХранилищаПодключенныеБанки);
	ОтборОкрываемойФормы.Вставить("Ссылка", ПодключенныеБанки);
	ПараметрыОткрываемойФормы.Вставить("Отбор", ОтборОкрываемойФормы);
	ПараметрыОткрываемойФормы.Вставить("ОтображениеТаблицы", ОтображениеТаблицы.Список);
	ОткрытьФорму(
		"Справочник.КлассификаторБанков.ФормаВыбора",
		ПараметрыОткрываемойФормы,
		Элемент,
		УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти
